ЧартерEDT.Расширение1/src/Documents/чартер_КвотыОрганизаций/чартер_КвотыОрганизаций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>чартер_КвотыОрганизаций</name>
  <registerRecords>InformationRegister.чартер_КвотированиеОрганизацийНаРейс</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.чартер_Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодРегистрации</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Квоты</name>
    <attributes>
      <name>ТипКомпановки</name>
      <type>
        <types>EnumRef.чартер_ТипВСРассадка</types>
      </type>
    </attributes>
    <attributes>
      <name>Квота</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ЧартерEDT.Расширение1/src/InformationRegisters/чартер_КвотированиеОрганизацийНаРейс/чартер_КвотированиеОрганизацийНаРейс.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>чартер_КвотированиеОрганизацийНаРейс</name>
  <informationRegisterPeriodicity>Month</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Квота</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.чартер_Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипКомпановки</name>
    <type>
      <types>EnumRef.чартер_ТипВСРассадка</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ЧартерEDT.Расширение1/src/Documents/чартер_КвотыОрганизаций/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Движения.чартер_КвотированиеОрганизацийНаРейс.Записывать = Истина;
	Движения.чартер_КвотированиеОрганизацийНаРейс.Очистить();
	
	Для Каждого СтрокаКвоты Из Квоты Цикл
		
		Движение = Движения.чартер_КвотированиеОрганизацийНаРейс.Добавить();
		
		Движение.Регистратор = Ссылка;
		Движение.Период = ПериодРегистрации;
		ЗаполнитьЗначенияСвойств(Движение, ЭтотОбъект);
		ЗаполнитьЗначенияСвойств(Движение, СтрокаКвоты);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
				   |	чартер_ТипВСРассадка.Ссылка КАК ТипКомпановки,
				   |    0 КАК Квота
				   |ИЗ
				   |	Перечисление.чартер_ТипВСРассадка КАК чартер_ТипВСРассадка";

	РезультатЗапроса = Запрос.Выполнить();
	Квоты.Загрузить(РезультатЗапроса.Выгрузить());

КонецПроцедуры
#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
